app/Models/usuario_Model.php

SELECT *
FROM `usuarios`
---
    public function getUsuarios(){

        return $this->findAll();